Autodesk.Navisworks.Api.NativeHandle
Common base class for classes which act as a managed handle to an implementation in native, unmanaged code

Autodesk.Navisworks.Api.NativeHandle.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Autodesk.Navisworks.Api.NativeHandle.Dispose(System.Boolean)


Autodesk.Navisworks.Api.NativeHandle.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.NativeHandle.Finalize
Allows an  to attempt to free resources and perform other cleanup operations before the  is reclaimed by garbage collection.

Autodesk.Navisworks.Api.NativeHandle.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.NativeHandle.IsDisposed
Gets a value indicating whether the object has been disposed and is no longer available.

Autodesk.Navisworks.Api.NativeHandle.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.NativeHandle.op_Equality(Autodesk.Navisworks.Api.NativeHandle,Autodesk.Navisworks.Api.NativeHandle)
Determines whether the two objects refer to the same underlying native object.
Returns false if either object has been disposed.

Autodesk.Navisworks.Api.NativeHandle.op_Inequality(Autodesk.Navisworks.Api.NativeHandle,Autodesk.Navisworks.Api.NativeHandle)
Determines whether the two objects refer to different underlying native objects. Returns true
if either object has been disposed.

Autodesk.Navisworks.Api.NativeHandle.ReferenceEquals(Autodesk.Navisworks.Api.NativeHandle,Autodesk.Navisworks.Api.NativeHandle)
Determines whether the two handles refer to the same underlying native object.
Returns false if either handle has been disposed.
objA: First NativeHandle
objB: Second NativeHandle

Autodesk.Navisworks.Api.NativeHandle.ToString
Returns a  that represents the current .
Returns: A  that represents the current .